TBA/app/controllers/invoices_controller.rb

  def index
    @invoices = Invoice.all
---
SELECT "invoices".* FROM "invoices"

  def create
    @invoice = Invoice.new(invoice_params)
	@invoice.add_order_items_from_order(current_order)
	@invoice.save
---
INSERT INTO "invoices" ("name", "address", "email", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["name", "test"], ["address", "test"], ["email", "test"], ["created_at", "2016-04-22 03:46:44.407632"], ["updated_at", "2016-04-22 03:46:44.407632"]]

    def set_invoice
      @invoice = Invoice.find(params[:id])
---
SELECT  "invoices".* FROM "invoices" WHERE "invoices"."id" = ? LIMIT 1  [["id", 1]]