TBA/app/controllers/menus_controller.rb

  def index
    @menus = Menu.all
    @order_item = current_order.order_items.new
---
SELECT "order_items".* FROM "order_items" WHERE "order_items"."order_id" = ?  [["order_id", 1]]