TBA/app/controllers/order_items_controller.rb

SELECT "order_items".* FROM "order_items" WHERE "order_items"."order_id" = ?  [["order_id", 1]]
INSERT INTO "order_items" ("quantity", "menu_id", "order_id", "unit_price", "total_price", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?)  [["quantity", 1], ["menu_id", 1], ["order_id", 1], ["unit_price", 0.49], ["total_price", 0.49], ["created_at", "2016-04-22 03:45:48.302709"], ["updated_at", "2016-04-22 03:45:48.302709"]]
INSERT INTO "orders" ("subtotal", "created_at", "updated_at") VALUES (?, ?, ?)  [["subtotal", 0.49], ["created_at", "2016-04-22 03:45:48.302709"], ["updated_at", "2016-04-22 03:45:48.302709"]]
---
  def create
    @order = current_order
    @order_item = @order.order_items.new(order_item_params)
    @order.save

SELECT  "order_items".* FROM "order_items" WHERE "order_items"."order_id" = ? AND "order_items"."id" = ? LIMIT 1  [["order_id", 2], ["id", 3]]
SELECT  "orders".* FROM "orders" WHERE "orders"."id" = ? LIMIT 1  [["id", 2]]
UPDATE "order_items" SET "quantity" = ?, "total_price" = ?, "updated_at" = ? WHERE "order_items"."id" = ?  [["quantity", 2], ["total_price", 0.98], ["updated_at", "2016-04-28 14:01:24.672015"], ["id", 3]]
---
  def update
    @order = current_order
    @order_item = @order.order_items.find(params[:id])
    @order_item.update_attributes(order_item_params)

SELECT  "order_items".* FROM "order_items" WHERE "order_items"."order_id" = ? AND "order_items"."id" = ? LIMIT 1  [["order_id", 2], ["id", 3]]
SELECT  "orders".* FROM "orders" WHERE "orders"."id" = ? LIMIT 1  [["id", 2]]
DELETE FROM "order_items" WHERE "order_items"."id" = ?  [["id", 3]]
---
  def destroy
    @order = current_order
    @order_item = @order.order_items.find(params[:id])
    @order_item.destroy